PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_hw_vu.h
/* Instructions with memory buffer operands, category II */
#define CY_CRYPTO_VU_MOV_OPC                  (0x30u)
#define CY_CRYPTO_VU_XSQUARE_OPC              (0x31u)
#define CY_CRYPTO_VU2_USQUARE_OPC             (0x2Fu)

/* Instructions with memory buffer operands, category III */
#define CY_CRYPTO_VU_CMP_SUB_OPC              (0x3Du)
#define CY_CRYPTO_VU_CMP_DEGREE_OPC           (0x3Eu)

/* Instructions with memory buffer operands, category IV */
#define CY_CRYPTO_VU_TST_OPC                  (0x3fu)

/* Instructions with memory buffer operands, category V */
#define CY_CRYPTO_VU_XMUL_OPC                 (0x32u)
#define CY_CRYPTO_VU_UMUL_OPC                 (0x33u)
#define CY_CRYPTO_VU_ADD_OPC                  (0x36u)
#define CY_CRYPTO_VU_SUB_OPC                  (0x37u)
#define CY_CRYPTO_VU_OR_OPC                   (0x38u)
#define CY_CRYPTO_VU_AND_OPC                  (0x39u)
#define CY_CRYPTO_VU_XOR_OPC                  (0x3Au)
#define CY_CRYPTO_VU_NOR_OPC                  (0x3Bu)
#define CY_CRYPTO_VU_NAND_OPC                 (0x3Cu)

/* Instructions with memory buffer operands, category VI */
#define CY_CRYPTO_VU2_SET_BIT_IMM_OPC         (0x2Cu)
#define CY_CRYPTO_VU2_CLR_BIT_IMM_OPC         (0x2Du)
#define CY_CRYPTO_VU2_INV_BIT_IMM_OPC         (0x2Eu)

#define CY_CRYPTO_VU1_WAIT_FOR_COMPLETE(base)  do { ; } while (0uL != _FLD2VAL(CRYPTO_STATUS_VU_BUSY, REG_CRYPTO_STATUS(base)))
#define CY_CRYPTO_VU_READ_SP_REG(base)         CY_CRYPTO_VU_GET_REG_DATA(REG_CRYPTO_VU_RF_DATA(base, 15u))

__STATIC_INLINE void CY_CRYPTO_VU_SAVE_REG(CRYPTO_Type *base, uint32_t rsrc, uint32_t *data);
__STATIC_INLINE void CY_CRYPTO_VU_RESTORE_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t data);
__STATIC_INLINE void CY_CRYPTO_VU_SET_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t data, uint32_t size);


__STATIC_INLINE void CY_CRYPTO_VU_COND_MOV_REG_TO_STATUS(CRYPTO_Type *base, uint32_t cc, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_MOV_REG_TO_STATUS_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rsrc));
}

__STATIC_INLINE void CY_CRYPTO_VU_MOV_REG_TO_STATUS(CRYPTO_Type *base, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_MOV_REG_TO_STATUS(base, CY_CRYPTO_VU_COND_ALWAYS, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_MOV_STATUS_TO_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_MOV_STATUS_TO_REG_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_MOV_STATUS_TO_REG(CRYPTO_Type *base, uint32_t rdst)
{
    CY_CRYPTO_VU_COND_MOV_STATUS_TO_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_MOV_IMM_TO_STATUS(CRYPTO_Type *base, uint32_t cc, uint32_t imm4)
{
    if (CY_CRYPTO_V1)
    {
        /******* V1 *********/
        uint32_t tmpReg = CY_CRYPTO_VU_HW_REG14;
        uint32_t tmpData;

        CY_CRYPTO_VU_SAVE_REG(base, tmpReg, &tmpData);

        /* Load 4 bit immediate value */
        CY_CRYPTO_VU_SET_REG(base, tmpReg, imm4, 4u);
        CY_CRYPTO_VU_COND_MOV_REG_TO_STATUS(base, cc, tmpReg);

        CY_CRYPTO_VU1_WAIT_FOR_COMPLETE(base);

        CY_CRYPTO_VU_RESTORE_REG(base, tmpReg, tmpData);
    }
    else
    {
        /******* V2 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU2_MOV_IMM_TO_STATUS_OPC,
                                   ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)imm4 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_MOV_IMM_TO_STATUS(CRYPTO_Type *base, uint32_t imm4)
{
    CY_CRYPTO_VU_COND_MOV_IMM_TO_STATUS(base, CY_CRYPTO_VU_COND_ALWAYS, imm4);
}

/*******************************************************************************/
__STATIC_INLINE void CY_CRYPTO_VU_SET_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t data, uint32_t size)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_SET_REG_OPC,
                               ((uint32_t)rdst << CY_CRYPTO_RSRC26_SHIFT) |
                               ((uint32_t)data << ((CY_CRYPTO_V1) ? CY_CRYPTO_RSRC12_SHIFT : CY_CRYPTO_RSRC13_SHIFT)) |
                               (((uint32_t)size - 1u) << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_LD_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_LD_REG_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_LD_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_LD_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_ST_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_ST_REG_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_ST_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_ST_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_MOV_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_MOV_REG_TO_STATUS_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_MOV_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_MOV_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_SWAP_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_SWAP_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_SWAP_REG(CRYPTO_Type *base, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_SWAP_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_ADD_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_ADD_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_ADD_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_ADD_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_SUB_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_SUB_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_SUB_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_SUB_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_OR_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_OR_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

