PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_hw_vu.h
__STATIC_INLINE void CY_CRYPTO_VU_OR_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_OR_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_AND_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_AND_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_AND_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_AND_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_XOR_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_XOR_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_XOR_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_XOR_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_NOR_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_NOR_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_NOR_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_NOR_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_NAND_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_NAND_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_NAND_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_NAND_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_MIN_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_MIN_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_MIN_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_MIN_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_MAX_REG(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_MAX_REG_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_MAX_REG(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_MAX_REG(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_PUSH_REG(CRYPTO_Type *base, uint32_t cc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_PUSH_REG_OPC,
                               ((uint32_t)cc << CY_CRYPTO_RSRC20_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_PUSH_REG(CRYPTO_Type *base)
{
    CY_CRYPTO_VU_COND_PUSH_REG(base, CY_CRYPTO_VU_COND_ALWAYS);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_POP_REG(CRYPTO_Type *base, uint32_t cc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_POP_REG_OPC,
                               ((uint32_t)cc << CY_CRYPTO_RSRC20_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_POP_REG(CRYPTO_Type *base)
{
    CY_CRYPTO_VU_COND_POP_REG(base, CY_CRYPTO_VU_COND_ALWAYS);
}

__STATIC_INLINE cy_en_crypto_status_t CY_CRYPTO_VU_COND_ALLOC_MEM(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t size)
{
    if ((uint32_t)(CY_CRYPTO_VU_READ_SP_REG(base) * 4u) < CY_CRYPTO_BYTE_SIZE_OF_BITS(size))
    {
        return CY_CRYPTO_MEMORY_ALLOC_FAIL;
    }

    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_ALLOC_MEM_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << ((CY_CRYPTO_V1) ? CY_CRYPTO_RSRC12_SHIFT : CY_CRYPTO_RSRC16_SHIFT)) |
                               (((uint32_t)size - 1u)  << CY_CRYPTO_RSRC0_SHIFT));

