PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_hw_vu.h
    return CY_CRYPTO_SUCCESS;
}

__STATIC_INLINE cy_en_crypto_status_t CY_CRYPTO_VU_ALLOC_MEM(CRYPTO_Type *base, uint32_t rdst, uint32_t size)
{
    return CY_CRYPTO_VU_COND_ALLOC_MEM(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, size);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_FREE_MEM(CRYPTO_Type *base, uint32_t cc, uint32_t reg_mask)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_FREE_MEM_OPC,
                               ((uint32_t)cc << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)reg_mask));
}

__STATIC_INLINE void CY_CRYPTO_VU_FREE_MEM(CRYPTO_Type *base, uint32_t reg_mask)
{
    CY_CRYPTO_VU_COND_FREE_MEM(base, CY_CRYPTO_VU_COND_ALWAYS, reg_mask);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_LSL(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    if ((CY_CRYPTO_V1) && (0u == REG_CRYPTO_VU_RF_DATA(base, rsrc0)))
    {
        CY_CRYPTO_VU_COND_XOR_REG(base, cc, rdst, rsrc1, rsrc0);
    }
    else
    {

        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU_LSL_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                                   ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_LSL(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_LSL(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_LSL1(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1)
{
    if (CY_CRYPTO_V1)
    {
        /******* V1 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU_LSL1_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT));
    }
    else
    {
        /******* V2 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU_LSL1_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                                   ((uint32_t)CY_CRYPTO_VU_HW_REG15 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_LSL1(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1)
{
    CY_CRYPTO_VU_COND_LSL1(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_LSL1_WITH_CARRY(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1)
{
    if (CY_CRYPTO_V1)
    {
        /******* V1 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU_LSL1_WITH_CARRY_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT));
    }
    else
    {
        /******* V2 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU_LSL1_WITH_CARRY_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                                   ((uint32_t)CY_CRYPTO_VU_HW_REG15 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_LSL1_WITH_CARRY(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1)
{
    CY_CRYPTO_VU_COND_LSL1_WITH_CARRY(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_LSR(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{

    if ((CY_CRYPTO_V1) && (0u == REG_CRYPTO_VU_RF_DATA(base, rsrc0)))
    {
        CY_CRYPTO_VU_COND_XOR_REG(base, cc, rdst, rsrc1, rsrc0);
    }
    else
    {
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)((CY_CRYPTO_V1) ? CY_CRYPTO_VU1_LSR_OPC : CY_CRYPTO_VU2_LSR_OPC),
                                   ((uint32_t)cc       << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst     << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1    << CY_CRYPTO_RSRC4_SHIFT)  |
                                   ((uint32_t)rsrc0    << CY_CRYPTO_RSRC0_SHIFT));

    }
}

__STATIC_INLINE void CY_CRYPTO_VU_LSR(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_LSR(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_LSR1(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1)
{
    if (CY_CRYPTO_V1)
    {
        /******* V1 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU1_LSR1_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT));
    }
    else
    {
        /******* V2 *********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU2_LSR1_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                                   ((uint32_t)CY_CRYPTO_VU_HW_REG15 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_LSR1(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1)
{
    CY_CRYPTO_VU_COND_LSR1(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1);
}

