PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_hw_vu.h
        CY_CRYPTO_VU_RESTORE_REG(base, tmpReg, tmpData);
    }
    else
    {
        /******** V2 ********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU2_SET_BIT_IMM_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC16_SHIFT) |
                                   ((uint32_t)imm13 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_SET_BIT_IMM(CRYPTO_Type *base, uint32_t rdst, uint32_t imm13)
{
    CY_CRYPTO_VU_COND_SET_BIT_IMM(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, imm13);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_CLR_BIT_IMM(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t imm13)
{
    if (CY_CRYPTO_V1)
    {
        /******** V1 ********/
        uint32_t tmpReg = (rdst != CY_CRYPTO_VU_HW_REG14) ? CY_CRYPTO_VU_HW_REG14 : CY_CRYPTO_VU_HW_REG13;
        uint32_t tmpData;
        CY_CRYPTO_VU_SAVE_REG(base, tmpReg, &tmpData);

        /* Load 13 bit immediate value */
        CY_CRYPTO_VU_SET_REG(base, tmpReg, imm13, 13u);
        CY_CRYPTO_VU_COND_CLR_BIT(base, cc, rdst, tmpReg);

        CY_CRYPTO_VU1_WAIT_FOR_COMPLETE(base);

        CY_CRYPTO_VU_RESTORE_REG(base, tmpReg, tmpData);
    }
    else
    {
        /******** V2 ********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU2_CLR_BIT_IMM_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC16_SHIFT) |
                                   ((uint32_t)imm13 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_CLR_BIT_IMM(CRYPTO_Type *base, uint32_t rdst, uint32_t imm13)
{
    CY_CRYPTO_VU_COND_CLR_BIT_IMM(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, imm13);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_INV_BIT_IMM(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t imm13)
{
    if (CY_CRYPTO_V1)
    {
        /******** V1 ********/
        uint32_t tmpReg = (rdst != CY_CRYPTO_VU_HW_REG14) ? CY_CRYPTO_VU_HW_REG14 : CY_CRYPTO_VU_HW_REG13;
        uint32_t tmpData;
        CY_CRYPTO_VU_SAVE_REG(base, tmpReg, &tmpData);

        /* Load 13 bit immediate value */
        CY_CRYPTO_VU_SET_REG(base, tmpReg, imm13, 13u);
        CY_CRYPTO_VU_COND_INV_BIT(base, cc, rdst, tmpReg);

        CY_CRYPTO_VU1_WAIT_FOR_COMPLETE(base);

        CY_CRYPTO_VU_RESTORE_REG(base, tmpReg, tmpData);
    }
    else
    {
        /******** V2 ********/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU2_INV_BIT_IMM_OPC,
                                   ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst  << CY_CRYPTO_RSRC16_SHIFT) |
                                   ((uint32_t)imm13 << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_INV_BIT_IMM(CRYPTO_Type *base, uint32_t rdst, uint32_t imm13)
{
    CY_CRYPTO_VU_COND_INV_BIT_IMM(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, imm13);
}

/******************************************************************************/
__STATIC_INLINE void CY_CRYPTO_VU_COND_TST(CRYPTO_Type *base, uint32_t cc, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_TST_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_TST(CRYPTO_Type *base, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_TST(base, CY_CRYPTO_VU_COND_ALWAYS, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_MOV(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_MOV_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_MOV(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_MOV(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_XSQUARE(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_XSQUARE_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_XSQUARE(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_XSQUARE(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_XMUL(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_XMUL_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_XMUL(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_XMUL(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}


__STATIC_INLINE void CY_CRYPTO_VU_COND_UMUL(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_UMUL_OPC,
                               ((uint32_t)cc    << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst  << CY_CRYPTO_RSRC12_SHIFT) |
                               ((uint32_t)rsrc1 << CY_CRYPTO_RSRC4_SHIFT)  |
                               ((uint32_t)rsrc0 << CY_CRYPTO_RSRC0_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_UMUL(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc1, uint32_t rsrc0)
{
    CY_CRYPTO_VU_COND_UMUL(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc1, rsrc0);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_USQUARE(CRYPTO_Type *base, uint32_t cc, uint32_t rdst, uint32_t rsrc)
{
    if (CY_CRYPTO_V1)
    {
        /***** V1 *******/
        CY_CRYPTO_VU_COND_UMUL(base, cc, rdst, rsrc, rsrc);
    }
    else
    {
        /***** V2 *******/
        Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                                   (uint32_t)CY_CRYPTO_VU2_USQUARE_OPC,
                                   ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                                   ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT) |
                                   ((uint32_t)rsrc << CY_CRYPTO_RSRC0_SHIFT));
    }
}

__STATIC_INLINE void CY_CRYPTO_VU_USQUARE(CRYPTO_Type *base, uint32_t rdst, uint32_t rsrc)
{
    CY_CRYPTO_VU_COND_USQUARE(base, CY_CRYPTO_VU_COND_ALWAYS, rdst, rsrc);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_SET_TO_ZERO(CRYPTO_Type *base, uint32_t cc, uint32_t rdst)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_SET_TO_ZERO_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT));
}

__STATIC_INLINE void CY_CRYPTO_VU_SET_TO_ZERO(CRYPTO_Type *base, uint32_t rdst)
{
    CY_CRYPTO_VU_COND_SET_TO_ZERO(base, CY_CRYPTO_VU_COND_ALWAYS, rdst);
}

__STATIC_INLINE void CY_CRYPTO_VU_COND_SET_TO_ONE(CRYPTO_Type *base, uint32_t cc, uint32_t rdst)
{
    Cy_Crypto_Core_Vu_RunInstr(base, CY_CRYPTO_SYNC_NON_BLOCKING,
                               (uint32_t)CY_CRYPTO_VU_SET_TO_ONE_OPC,
                               ((uint32_t)cc   << CY_CRYPTO_RSRC20_SHIFT) |
                               ((uint32_t)rdst << CY_CRYPTO_RSRC12_SHIFT));
}

